import React from 'react';
import './AboutMe.css';

const About = () => {
  return (
    <section id="aboutMe">
      <div className="intro">
        <div className="aboutMe">
          <h2>첫인상을 주는 프론트엔드</h2>
          <p>
            프론트엔드 기술을 배우면서 PHP, JSP, Express, React를 활용한 다양한 웹 개발 프로젝트를 경험했습니다. 사용자에게 첫인상을 주는 프론트엔드에 특히 흥미를 느껴, 이 분야에 집중하며 실력을 쌓아왔습니다.
          </p>
          
          <h2>성장에 대한 즐거움</h2>
          <p>
            새로운 프로젝트를 시작할 때마다 단순히 이전에 사용하던 기술을 반복하지 않고, 이전 프로젝트에서 아쉬웠던 부분을 개선하고 새로운 코드 스타일이나 기술을 적용하는 것에 큰 즐거움을 느낍니다. 이러한 과정은 제 개발 역량을 지속적으로 성장시키는 원동력이 되고 있습니다.
          </p>
          
          <h2>꺾이지 않는 마음</h2>
          <p>
            프론트엔드 개발 프로젝트를 대부분 혼자 진행하면서, 모든 것을 스스로 찾아내고 해결해야 했습니다. 때로는 기능 구현에 며칠이 걸리기도 했지만, 이러한 과정을 통해 "해결할 수 없는 문제는 없다"는 확신을 가지게 되었습니다. 이를 통해 꺾이지 않는 마음으로 어떤 문제든 극복할 수 있다는 자신감을 얻게 되었습니다.
          </p>
        </div>
      </div>
    </section>
  );
};

export default About;
